Revit 2027 API
RailingType.PrimaryHandrailHeight Property
 The height of the primary handrail.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double PrimaryHandrailHeight { get; }
Public ReadOnly Property PrimaryHandrailHeight As Double
	Get
public:
property double PrimaryHandrailHeight {
	double get ();
}
member PrimaryHandrailHeight : float with get
Property Value
Double
Exceptions
Exception | Condition
InvalidOperationException |  The rail has no primary hand rail.
See Also
Reference
RailingType Class
Autodesk.Revit.DB.Architecture Namespace